src/cf/Tasks/ЗадачаПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Task>
		<Properties>
			<Name>ЗадачаПользователя</Name>
			<Addressing>InformationRegister.Адресация</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ФактическийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>АвторЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/cf/Tasks/ЗадачаПользователя/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Администратор")Тогда
		Элементы.ДатаФактическогоВыполнения.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполненаПриИзмененииНаСервере()
	
	Если Объект.Выполнена Тогда
		Объект.ДатаФактическогоВыполнения = ТекущаяДата();
		Объект.ФактическийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Объект.ДатаФактическогоВыполнения = Дата("00010101"); 
		Объект.ФактическийПользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	ВыполненаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПустаяСсылка()
	Возврат БизнесПроцессы.Исполнение.ПустаяСсылка(); 
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (Объект.БизнесПроцесс <> ПустаяСсылка() И Объект.Наименование = "Проверка") = Истина Тогда 
		Ответ = Вопрос( "Задача выполнена успешно?", РежимДиалогаВопрос.ДаНет,0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Результат = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
